DataProcessors/ЗагрузкаДоговоровУТ_2013.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДоговоровУТ_2013</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДоговора</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеДоговора</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переносить</Name>
							<Comment>П</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аннулирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПоППЛО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокРасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Соглашение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоОКПО</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>(Общ) Любая дополнительная информация</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переносить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Переносить</Name>
							<Comment>П</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Договор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДокументУТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабАкты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Договор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переносить</Name>
							<Comment>П</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовУТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабГрафикиОплатыДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабОтгрузкиПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыДокументовУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыДокументовУТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПорядокРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ПорядокРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СоглашенияСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>СоглашенияСКлиентами</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ППЛО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаДоговоровУТ_2013/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ЗагрузитьВидДокумента( ВидДокумента )
	Попытка
		Возврат Перечисления.ВидыДокументовУТ[ВидДокумента];
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать вид документа " + ВидДокумента + ", " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецПопытки;
Конецфункции	

&НаСервереБезКонтекста
Функция ЗагрузитьПодразделение_НаСервере( НаименованиеПодразделения )
	СпрСс = Справочники.Подразделения.НайтиПоНаименованию( НаименованиеПодразделения, Истина);
	Если СпрСс.Пустая() Тогда 
		Сообщить("Добавляем подразделение " + НаименованиеПодразделения);
		СпРОб = Справочники.Подразделения.СоздатьЭлемент();
		СпрОб.Наименование = НаименованиеПодразделения;
		Попытка
			СпрОб.Записать();
			Возврат СпрОб.Ссылка;
		Исключение
			Сообщить("Не удалось записать подразделение " + НаименованиеПодразделения + ", " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
	Конецесли;
	Возврат СпрСс;
КонецФункции

&НаКлиенте
Функция ЗагрузитьПодразделение( ОЛЕПодразделение )
	Если ОЛЕПодразделение.Пустая() Тогда Возврат Неопределено; КонецЕсли;
	НаименованиеПодразделения = СокрЛП( ОЛЕПодразделение.Наименование );
	Если НЕ ЗначениеЗаполнено(НаименованиеПодразделения) Тогда Возврат Неопределено; КонецЕсли;
	
	Возврат ЗагрузитьПодразделение_НаСервере( НаименованиеПодразделения );
КонецФункции


&НаСервереБезКонтекста
Функция НайтиДоговорПоНомеру( НомерДоговора, ДатаДоговора )
	ДокСс = Документы.Договор.НайтиПоНомеру( НомерДоговора, ДатаДоговора );
	Если ДокСс.Пустая() Тогда Возврат Неопределено; КонецЕсли;
	Возврат ДокСс;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиОплатуПоНомеру(  НомерПлатежа, ДатаПлатежа )
	ДокСс = Документы.Оплата.НайтиПоНомеру(  НомерПлатежа, ДатаПлатежа );
	Если ДокСс.Пустая() Тогда Возврат Неопределено; КонецЕсли;
	Возврат ДокСс;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиОрганизациюПоПрефиксу( Префикс );		
	Возврат Справочники.Организации.НайтиПоРеквизиту( "Префикс", Префикс);
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьПорядокРасчетов( Название )
	
	Если Название = "По заказам"	Тогда
		Возврат Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	Иначе
		Возврат Перечисления.ПорядокРасчетов.ПоНакладным;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция КлиентНайтиКонтрагентаПоИННКПП(ИННКонтрагента, КППКонтрагента)
	Отбор = НОВЫЙ Структура("ИНН");
	Отбор.ИНН = ИННКонтрагента;
	
	Выборка = Справочники.Контрагенты.Выбрать( , , Отбор);
	Пока Выборка.Следующий() Цикл
		Если Выборка.КПП = КППКонтрагента Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// 21,10,2014
// ищем по заголовку в УТ 11
&НаКлиенте
Функция КлиентЗначениеДопР( БазаОЛЕ, ОбъектДопРекв, НазваниеДопРеквизита ) Экспорт
	ПВХ = БазаОЛЕ.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок", НазваниеДопРеквизита);
	Для Каждого СтрокаДР ИЗ ОбъектДопРекв.ДополнительныеРеквизиты Цикл
		Если СокрЛП(ПВХ.Заголовок)	=	СокрЛП(СтрокаДР.Свойство.Заголовок) Тогда
			Возврат СтрокаДР.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции



//*******************************************************************************
//	
//

&НаСервереБезКонтекста
Функция ЗагрузитьСоглашениеСКлиентом( Наименование, ДоговорПоППЛО = Ложь, ПорядокРасчетов )
	СпрСс = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию( Наименование, Истина );
	Если НЕ СпрСс.Пустая() Тогда
		Если СпрСс.ППЛО 			= ДоговорПоППЛО 
		и	 СпрСс.ПорядокРасчетов 	= ПорядокРасчетов Тогда
			Возврат СпрСс;
		Иначе
			СпрОб = СпрСс.ПолучитьОбъект();
		КонецЕсли;
	
	Иначе
		
		СпрОб = Справочники.СоглашенияСКлиентами.СоздатьЭлемент();
		СпрОб.Наименование 	= Наименование;
	КонецЕсли;
	СпрОб.ППЛО				= ДоговорПоППЛО;
	СпрОб.ПорядокРасчетов	= ПорядокРасчетов;
		
		
	Попытка
		СпрОб.Записать();
		Возврат СпрОб.Ссылка;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицу_НаКлиенте(  БазаОЛЕ  )
	Объект.ТабДоговоров.Очистить();
	Объект.ТабГрафикиОплатыДоговоров.Очистить();
	Объект.ТабОтгрузкиПоДоговору.Очистить();
	
	ВыборкаОЛЕ 	= БазаОЛЕ.Документы.ЗаказКлиента.Выбрать( НачалоДня(ПериодОтбора.ДатаНачала), КонецДня( ПериодОтбора.ДатаОкончания )); 
	Пока ВыборкаОЛЕ.Следующий()  Цикл
		Если НЕ ВыборкаОЛЕ.Проведен Тогда Продолжить; КонецЕсли;
		
		Аннулирован	= КлиентЗначениеДопР( БазаОЛЕ, ВыборкаОЛЕ.Ссылка, "Аннулирован");
		Если Аннулирован <> Неопределено И Аннулирован Тогда Продолжить; КонецЕсли;
		
		//Добавлено. Гумеидн Артур 12.12.2017
		//По требованию задачи #122980
		НеЗаполненоПолеВозвращен = Истина;
		Для Каждого ДопСвойство из ВыборкаОЛЕ.ДополнительныеРеквизиты Цикл 
			Если ДопСвойство.Свойство.Description = "Возвращен (Заказ клиента)" Тогда
				НеЗаполненоПолеВозвращен = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если НеЗаполненоПолеВозвращен Тогда Продолжить; КонецЕсли;
		//Конец добавления
		
		
		// 		
		ИННКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.ИНН);
		КППКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.КПП);
		Контрагент 		= КлиентНайтиКонтрагентаПоИННКПП( ИННКонтрагента,  КППКонтрагента);
		Если Контрагент = Неопределено Тогда
			Сообщить("Нет контрагента с ИНН [" + ИННКонтрагента + "], КПП [" + КППКонтрагента +"]");
			Продолжить;
		КонецЕсли;
		
		
		НомерДоговора 	= ВыборкаОЛЕ.Номер;
		//Если НомерДоговора = "М16/ГП-0020" Тогда
		Если НомерДоговора = "С17/ГП-0023" Тогда
			
			с=4;
		КонецЕсли;
		ДатаДоговора	= ВыборкаОЛЕ.Дата;
		Договор 		= НайтиДоговорПоНомеру( НомерДоговора,ДатаДоговора);
		Переносить		= ?(Договор = Неопределено, Истина, Ложь);
		
		//
		СтрДог 						= Объект.ТабДоговоров.Добавить();
		СтрДог.Переносить			= Переносить;
		СтрДог.Номер				= НомерДоговора;
		СтрДог.Дата			 		= ДатаДоговора; 
		СтрДог.Организация			= НайтиОрганизациюПоПрефиксу( СокрЛП(ВыборкаОЛЕ.Организация.Префикс) + "-" );
	
		СтрДог.НачалоДоговора		= КлиентЗначениеДопР( БазаОЛЕ, ВыборкаОЛЕ.Ссылка, "Начало");
		СтрДог.ОкончаниеДоговора	= КлиентЗначениеДопР( БазаОЛЕ, ВыборкаОЛЕ.Ссылка, "Окончание");
		СтрДог.Контрагент			= Контрагент;
		СтрДог.СуммаДокумента 		= ВыборкаОЛЕ.СуммаДокумента;
		//СтрДог.Аннулирован 			= Аннулирован;
		// проект ??? 21.10.2014
		СтрДог.Проект				= КлиентЗначениеДопР( БазаОЛЕ, ВыборкаОЛЕ.Ссылка, 			 "Проект");
		СтрДог.ДоговорПоППЛО 		= КлиентЗначениеДопР( БазаОЛЕ, ВыборкаОЛЕ.Ссылка.Соглашение, "Включает ПП(ЛО)");
		// в договор ставим из заказа клиента
		СтрДог.ПорядокРасчетов 		= ПолучитьПорядокРасчетов( БазаОЛЕ.String(ВыборкаОЛЕ.ПорядокРасчетов));
		// в справочник ставим из типового соглашения
		СтрДог.Соглашение			= ЗагрузитьСоглашениеСКлиентом( ВыборкаОЛЕ.Ссылка.Соглашение.Наименование, СтрДог.ДоговорПоППЛО, 
																	ПолучитьПорядокРасчетов( БазаОЛЕ.String(ВыборкаОЛЕ.Соглашение.ПорядокРасчетов)) );
		
		// Загружаем график оплаты
		//ГрафикОЛЕ = БазаОЛЕ.Справочники.ГрафикиОплаты.НайтиПоНаименованию( ВыборкаОЛЕ.ГрафикОплаты.Наименование);
		
		
		//Если 		СтрДог.ПорядокРасчетов = "По накладным" Тогда
		Если 		СтрДог.ПорядокРасчетов = ПредопределенноеЗначение( "Перечисление.ПорядокРасчетов.ПоНакладным") Тогда 
			// 2017 03 24
			// график оплаты берем из соглашения 
			ГрафикОЛЕ = БазаОЛЕ.Справочники.ГрафикиОплаты.НайтиПоНаименованию( ВыборкаОЛЕ.Соглашение.ГрафикОплаты.Наименование);
			
			Для Каждого Этап ИЗ ГрафикОЛЕ.Этапы Цикл
				// например предоплата 100%
				Если Этап.ПроцентПлатежа = 0 Тогда
					Продолжить;
				КонецЕсли;
				СтрГО = Объект.ТабГрафикиОплатыДоговоров.Добавить();
				СтрГО.Номер = НомерДоговора;
				ЗаполнитьЗначенияСвойств( СтрГО, Этап );
			КонецЦикла;
			
			// Загружаем даты отгрузки
			НеОтгружатьЧастями  	= ВыборкаОЛЕ.НеОтгружатьЧастями;
			ДатаОтгрузкиДоговора 	= ВыборкаОЛЕ.ДатаОтгрузки;
			ДатаОтгрузкиДоговора    = ?(ЗначениеЗаполнено( ДатаОтгрузкиДоговора), ДатаОтгрузкиДоговора, ВыборкаОЛЕ.Дата );
			Для Каждого СтрТов ИЗ ВыборкаОЛЕ.Товары Цикл
				// если дата
				ДатаОтгрузки =  ?( НеОтгружатьЧастями,  ДатаОтгрузкиДоговора, СтрТов.ДатаОтгрузки );
				// если дата не заполнена в строке
				ДатаОтгрузки = ?(ЗначениеЗаполнено( ДатаОтгрузки), ДатаОтгрузки, ВыборкаОЛЕ.Дата );
				
				
				Отбор = Новый Структура;
				Отбор.Вставить("Номер", 		НомерДоговора );
				Отбор.Вставить("ДатаОтгрузки",  ДатаОтгрузки );
				
				мСтр = Объект.ТабОтгрузкиПоДоговору.НайтиСтроки( Отбор );
				Если мСтр.Количество() = 0 Тогда
					СтрокаОД = Объект.ТабОтгрузкиПоДоговору.Добавить();
					ЗаполнитьЗначенияСвойств( СтрокаОД, Отбор );
				Иначе
					СтрокаОД = мСтр[0];
				КонецЕсли;
				СтрокаОД.Сумма = СтрокаОД.Сумма + СтрТов.Сумма;
			КонецЦикла;
			
			
		//ИначеЕсли СтрДог.ПорядокРасчетов = "По заказам" Тогда
		ИначеЕсли СтрДог.ПорядокРасчетов = ПредопределенноеЗначение( "Перечисление.ПорядокРасчетов.ПоЗаказамНакладным") Тогда 
			// просто переписываем индивидуальный график платежей по заказу
			Для Каждого ЭтапПлатежа ИЗ ВыборкаОЛЕ.ЭтапыГрафикаОплаты Цикл
				СтрГО = Объект.ТабГрафикиОплатыДоговоров.Добавить();
				СтрГО.Номер = НомерДоговора;
				// заполняются дата платежа, платежа и сумма
				ЗаполнитьЗначенияСвойств( СтрГО, ЭтапПлатежа );
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	//
	БазаОЛЕ =  УП_Клиент.КлиентПодключитьсяКБазеОЛЕ_ПоИмени( "УправлениеТорговлей" );
	Если БазаОЛЕ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//
	ЗаполнитьТаблицу_НаКлиенте(  БазаОЛЕ );
	БазаОЛЕ = "";
	
	ПоказатьПредупреждение(,"Таблица договоров заполнена!", 10);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьОбластьДоговора( ОбластьДоговор, Дог, Результат, Примечание )
	
	ЗаполнитьЗначенияСвойств( ОбластьДоговор.Параметры, Дог );
	//
	ОбластьДоговор.Параметры.Результат		= Результат;
	ОбластьДоговор.Параметры.Примечание		= Примечание;
	
	
КонецПроцедуры


&НаСервере
Функция НормироватьКоэффициенты( МассивКоэфф, Норма )
	мНормированныйКоэфф = Новый Массив;
	Если МассивКоэфф.Количество() = 0 Тогда
		Возврат мНормированныйКоэфф;
	КонецЕсли;
	
	Если МассивКоэфф.Количество() = 1 Тогда
		мНормированныйКоэфф.Добавить( Норма );
		Возврат мНормированныйКоэфф;
	КонецЕсли;
	мРез	= РаспределитьПропорционально( Норма, МассивКоэфф, 2);
	мНормированныйКоэфф = Новый Массив;
	Для Каждого РезК ИЗ мРез Цикл
	    мНормированныйКоэфф.Добавить( РезК );
	КонецЦикла;
	Возврат мНормированныйКоэфф;
КонецФункции


// коэффициенты в этапах оплаты относятся к сумме документа
// вначале суммы по отгрузке нормируем по сумме документа
// затем для каждой дате отгрузке распределяем её на 100%
// после этого расставляем проценты по суммам на 100%
&НаСервере
Процедура РаспределитьСуммыПоОтгрузкамПоОплатам( ДокОб, ОтгрузкиПоДоговору, ЭтапыОплаты )
	//
	ДокОб.ЭтапыГрафикаОплаты.Очистить();
	Сутки 		= 24 * 60 * 60;

	СуммаДокумента = ДокОб.СуммаДокумента;
	Если СуммаДокумента = 0 Тогда
		Возврат;
	КонецЕсли;
	// одинаковы для всех отгрузок
	мКоэффОплаты = НормироватьКоэффициенты( ЭтапыОплаты.ВыгрузитьКолонку( "ПроцентПлатежа"), 100);
	
	// 
	ИндексСуммы	= 0;
	мСуммы 		= НормироватьКоэффициенты( ОтгрузкиПоДоговору.ВыгрузитьКолонку( "Сумма"), СуммаДокумента );
	Для Каждого СтрокаОпД ИЗ ОтгрузкиПоДоговору Цикл
		// вместо СтрокаОпД.Сумма
		мРез 	= РаспределитьПропорционально( мСуммы[ИндексСуммы], мКоэффОплаты, 2);
		Индекс 	= 0;
		Для Каждого Этап ИЗ ЭтапыОплаты Цикл
			ДатаПлатежа		= СтрокаОпД.ДатаОтгрузки + Сутки * Этап.Сдвиг;
			СуммаПлатежа	= мРез[Индекс];
			Индекс = Индекс + 1;
			
			Если Не ЗначениеЗаполнено( ДатаПлатежа ) Тогда
				Сообщить("Не заполнена дата платежа " + ДокОб.Номер);
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено( СуммаПлатежа ) Тогда
				Сообщить("Не заполнена сумма платежа на " + Формат(ДатаПлатежа, "ДЛФ=DD")+ " " + ДокОб.Номер);
				Продолжить;
			КонецЕсли;
			СтрокаЭГО 				= ДокОб.ЭтапыГрафикаОплаты.Добавить();
			СтрокаЭГО.ДатаПлатежа 	= ДатаПлатежа;
			// Если
			СтрокаЭГО.СуммаПлатежа  = СуммаПлатежа;
			
		КонецЦикла;
		
		// 
		ИндексСуммы	= ИндексСуммы + 1;
	КонецЦикла;
	
	// теперь нормируем процент платежа по всему договору
	мНормированныйПП = НормироватьКоэффициенты( ДокОб.ЭтапыГрафикаОплаты.ВыгрузитьКолонку( "СуммаПлатежа"), 100);
	Индекс 	= 0;

	Для Каждого Этап ИЗ ДокОб.ЭтапыГрафикаОплаты Цикл
		Этап.ПроцентПлатежа = мНормированныйПП[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла;
		
КонецПроцедуры


//*************************************************************************
//	Если договор аннулирован и его нет, он не переносится, если есть, то помечается на удаление
//	Если договор не аннулирован, и его нет, то он создается, если он есть и помечен на удаление, то он снимается с удаления
//
&НаСервере
Процедура ЗагрузитьДоговоры_НаСервере( ТабДок )
	Макет = Обработки.ЗагрузкаДоговоровУТ_2013.ПолучитьМакет("ПротоколПереноса");
	//
	ТабДок.Очистить();
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПечПериодПереноса = ПредставлениеПериода( НачалоДня(ПериодОтбора.ДатаНачала), КонецДня(ПериодОтбора.ДатаОкончания),  "ФП = Истина");//"ДЛФ=D")
	ТабДок.Вывести(ОбластьШапка);
	
	СуммаВсего = 0;
	
	Для Каждого Дог Из Объект.ТабДоговоров Цикл
		Если НЕ Дог.Переносить Тогда Продолжить; КонецЕсли;
		//Дог.Переносить = Ложь;
		
		//
		ОбластьДоговор = Макет.ПолучитьОбласть("СтрокаДоговора");
		ОбластьДоговор.Параметры.НомерСтроки 	= Объект.ТабДоговоров.Индекс(Дог)+1;
		
		СуммаВсего 	= СуммаВсего + Дог.СуммаДокумента;
		
		// у договора не может быть изменен контрагент !!!
		ДокСс = Документы.Договор.НайтиПоНомеру( Дог.Номер, Дог.Дата );
		Результат	= "";
		
		Если ДокСс.Пустая() Тогда
			ДокОб 				= Документы.Договор.СоздатьДокумент();
			ДокОб.Дата			= Дог.Дата;
			ДокОб.Номер			= Дог.Номер;
			ДокОб.Контрагент	= Дог.Контрагент;
			Примечание			= "Новый документ";
			Результат 			= "Создан новый договор";
			//
			ОбластьДоговор.Параметры.СуммаДоговора	= 0;
		Иначе
			//			
			ДокОб 			= ДокСс.ПолучитьОбъект();
			
			ОбластьДоговор.Параметры.СуммаДоговора	= ДокОб.СуммаДокумента;
			
			Примечание		= "Существующий документ";
			Если ДокОб.Дата <> Дог.Дата Тогда
				Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + " изменена дата ("+ Формат(ДокОб.Дата, "ДЛФ=D")+")";
			КонецЕсли;
			
			Если ДокОб.СуммаДокумента <> Дог.СуммаДокумента  Тогда
				Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + " изменена сумма ("+ Формат(ДокОб.СуммаДокумента, "ЧЦ=15; ЧДЦ=2")+")";
			КонецЕсли;
			
			Если ДокОб.Контрагент <> Дог.Контрагент  Тогда
				Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + " изменен контрагент ("+ ДокОб.Контрагент + "), ИЗМЕНЕНИЕ ПРЕРВАНО";
				//
				ЗаполнитьОбластьДоговора( ОбластьДоговор, Дог, Результат, Примечание );
				ТабДок.Вывести( ОбластьДоговор );
				Продолжить;
				
			КонецЕсли;
			//
		КонецЕсли;
		
		Если Дог.Аннулирован Тогда
			Примечание		= "Договор аннулирован";
			Если НЕ ДокСс.Пустая() Тогда 	// нет в базе
				ДокОб.УстановитьПометкуУдаления( Истина );   // может надо записать?
				Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + " помечен на удаление";
			Иначе
				Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + " не создавался";
				
			КонецЕсли;
			//
			ЗаполнитьОбластьДоговора( ОбластьДоговор, Дог, Результат, Примечание );
			ТабДок.Вывести(ОбластьДоговор);
			Продолжить;
			
			
		Иначе // не аннулирован
			Если НЕ Дог.Переносить Тогда 
				Результат		= "Пропущен";
				Примечание		= "Нет отметки переносить";
				ЗаполнитьОбластьДоговора( ОбластьДоговор, Дог, Результат, Примечание );
				ТабДок.Вывести(ОбластьДоговор);
				
				Продолжить; 
				
			КонецЕсли;
			
			// может быть 
			Если НЕ ДокСс.Пустая() Тогда
				Если ДокОб.ПометкаУдаления Тогда
					Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + " снята пометка на удаление";
					ДокОб.УстановитьПометкуУдаления( Ложь );   		// может надо записать?
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		//
		ДокОб.Организация			= Дог.Организация;
		ДокОб.СуммаДокумента		= Дог.СуммаДокумента;
		ДокОб.Соглашение 			= Дог.Соглашение;
		//ДокОб.ДоговорПоППЛО			= Дог.ДоговорПоППЛО;
		//ДокОб.ДоговорПоУслугам		= НЕ Дог.ДоговорПоППЛО;
		//
		ДокОб.ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
		//
		ДокОб.ПорядокРасчетов		= Дог.ПорядокРасчетов;
		
		ЭтапыОплаты	 = Объект.ТабГрафикиОплатыДоговоров.Выгрузить( Новый Структура("Номер", Дог.Номер) );
		ДокОб.ЭтапыГрафикаОплаты.Очистить();
		
		Если 		Дог.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда //"По заказам" Тогда
			ДокОб.ЭтапыГрафикаОплаты.Загрузить( ЭтапыОплаты );
			
		ИначеЕсли 	Дог.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда // "По накладным" Тогда
			// 2016 11 09 
			// заполняем Этапы графика оплаты
			ДатыОтгрузки = Объект.ТабОтгрузкиПоДоговору.Выгрузить(  Новый Структура("Номер", Дог.Номер ));
			
			// каждую сумму отгрузки  распределяем пропорционально по этапам оплаты
			РаспределитьСуммыПоОтгрузкамПоОплатам( ДокОб, ДатыОтгрузки, ЭтапыОплаты );
		КонецЕсли;
		
		
		
		Дог.Переносить				= Ложь;
		
		Попытка
			Если ДокОб.Проведен Тогда 
				Режим	  = РежимЗаписиДокумента.Проведение;
				Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + " перепроведен";
			Иначе
				Режим	  = РежимЗаписиДокумента.Запись; 
				Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + " записан";
			КонецЕсли;
			
			//Если 	ДокОб.Номер = "Г16/1С-0016"
			//или	    ДокОб.Номер = "Г16/К-00033"
			//или	    ДокОб.Номер = "Г16/КР-0010" Тогда
			//
			//	// не все задачи в статусе в работе
			//	с=4;
			//КонецЕсли;
			
			ДокОб.Записать( Режим );
		Исключение
			Результат = Результат + ?(ЗначениеЗаполнено(Результат),",","") + 
						"не удалось записать договор " + Дог.Номер+", " + ОписаниеОшибки();
		КонецПопытки;
					
		ЗаполнитьОбластьДоговора( ОбластьДоговор, Дог, Результат, Примечание );
		ТабДок.Вывести(ОбластьДоговор);
		
		
	КонецЦикла;		
	
	ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.СуммаВсего = СуммаВсего;
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДоговоры(Команда)
	ТабДок = Новый ТабличныйДокумент;
	
	//
    ЗагрузитьДоговоры_НаСервере(ТабДок);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Истина;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.Показать();
	
	
	//Предупреждение("Договоры загружены", 10);
КонецПроцедуры

//***********************************************************************************************
&НаСервере
Функция КлиентСоздатьИерархию( НазвСправочника, НаименованиеРодителя )
	Возврат СоздатьИерархию( НазвСправочника, НаименованиеРодителя );
	
КонецФункции

//***********************************************************************************************
//		КОНТРАГЕНТЫ
//***********************************************************************************************

&НаКлиенте
Процедура ЗаполнитьТаблицуКонтрагентов_НаКлиенте( БазаОЛЕ )
	Объект.ТаблицаКонтрагентов.Очистить();
	
	ВыборкаОЛЕ = БазаОЛЕ.Справочники.Контрагенты.Выбрать();
	Пока ВыборкаОЛЕ.Следующий() Цикл
		// документ анулирован
		Если 		ВыборкаОЛЕ.ЭтоГруппа		Тогда Продолжить; КонецЕсли;
		Если 		ВыборкаОЛЕ.ПометкаУдаления	Тогда Продолжить; КонецЕсли;
		
		// 		
		ИННКонтрагента 		= СокрЛП(ВыборкаОЛЕ.ИНН);
		КППКонтрагента 		= СокрЛП(ВыборкаОЛЕ.КПП);
		Контрагент 	= КлиентНайтиКонтрагентаПоИННКПП( ИННКонтрагента, КППКонтрагента);
		Переносить	= (Контрагент = Неопределено);
		Если ТолькоНовые и НЕ Переносить Тогда Продолжить; КонецЕсли;
		
		//
		СтрКонтр 						= Объект.ТаблицаКонтрагентов.Добавить();
		СтрКонтр.Переносить				= Переносить;
		СтрКонтр.Контрагент				= Контрагент;
		СтрКонтр.Наименование			= ВыборкаОЛЕ.Наименование;
		// справочник контрагенты не иерахический, 
		// иерархию строим по справочнику партнеров
		Если БазаОЛЕ.ЗначениеЗаполнено( ВыборкаОЛЕ.Партнер.Родитель) Тогда
			СтрКонтр.Родитель 				= КлиентСоздатьИерархию( "Контрагенты", ВыборкаОЛЕ.Партнер.Родитель.ПолноеНаименование());
		КонецЕсли;
		СтрКонтр.ИНН					= ИННКонтрагента;
		СтрКонтр.КПП					= КППКонтрагента;
		СтрКонтр.КодПоОКПО				= ВыборкаОЛЕ.КодПоОКПО;
		СтрКонтр.НаименованиеПолное		= ВыборкаОЛЕ.НаименованиеПолное;
		СтрКонтр.Комментарий			= ВыборкаОЛЕ.ДополнительнаяИнформация;
		
	КонецЦикла;

	БазаОЛЕ = "";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуКонтрагентов(Команда)
	//
	БазаОЛЕ =  УП_Клиент.КлиентПодключитьсяКБазеОЛЕ_ПоИмени( "УправлениеТорговлей" );
	Если БазаОЛЕ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//
	ЗаполнитьТаблицуКонтрагентов_НаКлиенте(БазаОЛЕ);
	БазаОЛЕ = "";
	ПоказатьПредупреждение(,"Таблица контрагентов заполнена!", 10);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьфлажкиКонтрагентов(Команда)
	ИзменитьФлажки( Объект.ТаблицаКонтрагентов,  Ложь );
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиКонтрагентов(Команда)
	ИзменитьФлажки( Объект.ТаблицаКонтрагентов,  Истина );
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКонтрагентов_НаСервере( )
	Для Каждого Стр Из Объект.ТаблицаКонтрагентов Цикл
		Если НЕ Стр.Переносить Тогда Продолжить; КонецЕсли;
		
		Если Стр.Контрагент.Пустая() Тогда
			КонтрОб = Справочники.Контрагенты.СоздатьЭлемент();
		Иначе
			КонтрОб = Стр.Контрагент.ПолучитьОбъект();
		КонецЕсли;
		
		КонтрОб.Родитель			= Стр.Родитель;
		КонтрОб.Наименование 		= Стр.Наименование;
		КонтрОб.ИНН					= Стр.ИНН;
		КонтрОб.КПП					= Стр.КПП;
		КонтрОб.КодПоОКПО			= Стр.КодПоОКПО;
		КонтрОб.НаименованиеПолное	= Стр.НаименованиеПолное;
		КонтрОб.Комментарий			= Стр.Комментарий;
		//
		Стр.Переносить				= Ложь;
		
		Попытка
			КонтрОб.Записать();
		Исключение
			
			Сообщить("Не удалось записать контрагента " + Стр.Наименование + ", " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонтргентов(Команда)
	ЗагрузитьКонтрагентов_НаСервере();
	ПоказатьПредупреждение(,"Контрагенты загружены", 10);
КонецПроцедуры

//***********************************************************************************************
//		УПРАВЛЕНЧЕСКАЯ РЕАЛИЗАЦИЯ
//***********************************************************************************************

//&НаКлиенте
//Процедура ЗаполнитьТаблицуПоВидуДокумента_НаКлиенте(БазаОЛЕ, ВидДокумента, НазваниеТабЧасти )
//	
//	
//	ВыборкаОЛЕ = БазаОЛЕ.Документы[ВидДокумента].Выбрать( НачалоДня(ПериодОтбора.ДатаНачала), КонецДня( ПериодОтбора.ДатаОкончания )); 

//	Пока ВыборкаОЛЕ.Следующий()  Цикл
//		// не проведен
//		Если НЕ ВыборкаОЛЕ.Проведен	Тогда Продолжить; КонецЕсли;
//		
//		// аннулирован
//		Аннулирован	= КлиентЗначениеДопР( БазаОЛЕ, ВыборкаОЛЕ.Ссылка, "Аннулирован");
//		Если Аннулирован = Неопределено Тогда
//		// не указано, т.е не аннулирован
//		ИначеЕсли Аннулирован 			Тогда 
//			Продолжить; 
//		КонецЕсли;
//		ИННКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.ИНН);
//		КППКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.КПП);
//		Контрагент 		= КлиентНайтиКонтрагентаПоИННКПП( ИННКонтрагента,  КППКонтрагента);
//		Если Контрагент = Неопределено Тогда
//			Сообщить("Нет контрагента с ИНН [" + ИННКонтрагента + "], КПП [" + КППКонтрагента +"]");
//			Продолжить;
//		КонецЕсли;
//		//
//		Префикс		= СокрЛП(ВыборкаОЛЕ.Организация.Префикс) + "-";
//		Организация	= НайтиОрганизациюПоПрефиксу(Префикс);
//		Если Организация.Пустая() Тогда
//			Сообщить("Не найдена организация с префиксом  " + Префикс );
//			Продолжить;
//		КонецЕсли;
//		
//		// 
//		ДоговорКонтрагента			= НайтиДоговорПоНомеру( ВыборкаОЛЕ.ЗаказКлиента.Номер,	Контрагент );
//		Если ДоговорКонтрагента = Неопределено Тогда
//			Сообщить("У контрагента " + Контрагент + " не найден договор " + ВыборкаОЛЕ.ЗаказКлиента.Номер);
//			//Продолжить; 
//		КонецЕсли;									
//		
//		СтрДок 						= ТабУправленческаяРеализация.Добавить();
//		СтрДок.Переносить			= Истина;
//		СтрДок.GUID 				= БазаОЛЕ.String(ВыборкаОЛЕ.Ссылка.УникальныйИдентификатор());
//		СтрДок.ВидДокумента 		= ВидДокумента;
//		СтрДок.Дата					= ВыборкаОЛЕ.Дата;
//		СтрДок.Номер				= ВыборкаОЛЕ.Номер;
//		СтрДок.ДоговорКонтрагента	= ДоговорКонтрагента;
//		СтрДок.Контрагент 			= Контрагент;
//		СтрДок.Организация 			= Организация;
//		СтрДок.СуммаДокумента		= ВыборкаОЛЕ.СуммаДокумента;
//		
//		Подразделение 	= ЗагрузитьПодразделение( ВыборкаОЛЕ.Подразделение );
//		Для Каждого ТоварОЛЕ ИЗ ВыборкаОЛЕ[НазваниеТабЧасти] Цикл
//			КатегорияНоменклатуры = КлиентЗначениеДопР( БазаОЛЕ, ТоварОЛЕ.Номенклатура, "Категория номенклатуры");
//			Если КатегорияНоменклатуры = Неопределено Тогда
//				КатегорияНоменклатуры 	= "Не указана";
//			Иначе
//				КатегорияНоменклатуры 	= КатегорияНоменклатуры.Наименование;
//			КонецЕсли;
//			СтрТов = СтрДок.Распределение.Добавить();
//			СтрТов.Подразделение 			= Подразделение;
//			// ??
//			СтрТов.КатегорияНоменклатуры	= КатегорияНоменклатуры;
//			СтрТов.Сумма					= ТоварОЛЕ.СуммаСНДС;
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПосчитатьСуммуПереносимойРеализации()
//	ИтогоСуммаПереносимыхДокументов = 0;
//	Для Каждого СтрУР ИЗ ТабУправленческаяРеализация Цикл
//		ИтогоСуммаПереносимыхДокументов = ИтогоСуммаПереносимыхДокументов+ ?(СтрУР.Переносить, СтрУР.СуммаДокумента, 0);
//	КонецЦикла;
//КонецПроцедуры



//***********************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажки( Таб,  Переносить )
	Для Каждого Стр Из Таб Цикл
		Стр.Переносить = Переносить;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	//Если ЭтаФорма.Элементы
	ИзменитьФлажки( Объект.ТабДоговоров, Истина );
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьФлажки( Объект.ТабДоговоров,  Ложь );
КонецПроцедуры



//&НаКлиенте
//Процедура ТабУправленческаяРеализацияПереноситьПриИзменении(Элемент)
//	ПосчитатьСуммуПереносимойРеализации();
//КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиОпл(Команда)
	ИзменитьФлажки( Объект.ТабОплаты,  Ложь );
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиОпл(Команда)
	ИзменитьФлажки( Объект.ТабОплаты,  Истина );
КонецПроцедуры

//**************************************************************************
// оплата договоров


// ???
&НаКлиенте
Функция АктПоОплате( БазаОЛЕ, ОплатаОЛЕ )
	Отбор = БазаОЛЕ.NewObject("Структура");
	Отбор.Вставить( "ПоступлениеБезналичныхДенежныхСредств", ОплатаОЛЕ );
	ВыбОплаты = БазаОЛЕ.РегистрыСведений.ПлатежиПоДокументамЗаказа.Выбрать( Отбор );
	Пока ВыбОплаты.Следующий() Цикл
		// guid акта
		Попытка
			GUIDАкта = БазаОЛЕ.String(ВыбОплаты.АктРеализация.УникальныйИдентификатор());
			Возврат АктПоGUID(GUIDАкта);
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	ВОзврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОплату_НаКлиенте(  БазаОЛЕ )
	Объект.ТабОплаты.Очистить();
	
	ВыборкаОЛЕ 	= БазаОЛЕ.Документы.ПоступлениеБезналичныхДенежныхСредств.Выбрать( НачалоДня(ПериодОтбора.ДатаНачала), КонецДня( ПериодОтбора.ДатаОкончания )); 
	Пока ВыборкаОЛЕ.Следующий()  Цикл
		Если НЕ ВыборкаОЛЕ.Проведен Тогда Продолжить; КонецЕсли;
		
		// 		
		ИННКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.ИНН);
		КППКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.КПП);
		Контрагент 		= КлиентНайтиКонтрагентаПоИННКПП( ИННКонтрагента,  КППКонтрагента);
		Если Контрагент = Неопределено Тогда
			Сообщить("Нет контрагента с ИНН [" + ИННКонтрагента + "], КПП [" + КППКонтрагента +"]");
			Продолжить;
		КонецЕсли;
		Организация			= НайтиОрганизациюПоПрефиксу( СокрЛП(ВыборкаОЛЕ.Организация.Префикс) + "-" );
		
		НомерПлатежа 	= ВыборкаОЛЕ.Номер;
		ДатаПлатежа		= ВыборкаОЛЕ.Дата;
		//
		ДокументОплаты  = НайтиОплатуПоНомеру( НомерПлатежа, ДатаПлатежа );
		Для Каждого СтрОЛЕ ИЗ ВыборкаОЛЕ.РасшифровкаПлатежа Цикл
			// если нет договора, то не переносим платеж
			ИмяОснования = СтрОЛЕ.ОснованиеПлатежа.Метаданные().Имя;
			Если  		ИмяОснования = "АктВыполненныхРабот" 
			или 		ИмяОснования = "РеализацияТоваровУслуг" Тогда
				Если БазаОЛЕ.ЗначениеЗАполнено( СтрОЛЕ.ОснованиеПлатежа.ЗаказКлиента ) Тогда
					НомерДоговора 	= СтрОЛЕ.ОснованиеПлатежа.ЗаказКлиента.Номер;
					ДатаДоговора	= СтрОЛЕ.ОснованиеПлатежа.ЗаказКлиента.Дата;
					
					GUIDАкта 		= БазаОЛЕ.String(СтрОЛЕ.ОснованиеПлатежа.УникальныйИдентификатор());
					ДокументУТ 		= АктПоGUID(GUIDАкта);
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "В документе № " + НомерПлатежа + " от " + ДатаПлатежа + Символы.ПС + 
									  "в основании платежа не заполнен заказ клиента";
					Сообщение.Сообщить();
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли 	ИмяОснования = "ЗаказКлиента" Тогда
				НомерДоговора 	= СтрОЛЕ.ОснованиеПлатежа.Номер;
				ДатаДоговора	= СтрОЛЕ.ОснованиеПлатежа.Дата;
				
				ДокументУТ 		= АктПоОплате( БазаОЛЕ, ВыборкаОЛЕ.Ссылка );
				
			ИначеЕсли 	ИмяОснования = "СчетНаОплатуКлиенту" Тогда
				НомерДоговора 	= СтрОЛЕ.ОснованиеПлатежа.ДокументОснование.Номер;
				ДатаДоговора	= СтрОЛЕ.ОснованиеПлатежа.ДокументОснование.Дата;
				
				// может и не быть
				ДокументУТ 		= АктПоОплате( БазаОЛЕ, ВыборкаОЛЕ.Ссылка );
				
			Иначе
				Сообщить("Номер договора неопределен для " + ИмяОснования );
				Продолжить;
			КонецЕсли;
			Договор 		= НайтиДоговорПоНомеру( НомерДоговора, ДатаДоговора);
			Если Договор = Неопределено Тогда 
				Сообщить("Не найден договор №" + СтрОЛЕ.ОснованиеПлатежа.Номер + " от " + СтрОЛЕ.ОснованиеПлатежа.Дата);
				Продолжить;
			КонецЕсли;
		
			// платеж !!!
			СтрДок 						= Объект.ТабОплаты.Добавить();
			СтрДок.Переносить			= (ДокументОплаты = Неопределено);
			СтрДок.Номер				= НомерПлатежа;
			СтрДок.Дата			 		= ДатаПлатежа; 
			//
			СтрДок.Контрагент			= Контрагент;
			СтрДок.Организация			= Организация;
			СтрДок.СуммаДокумента 		= ВыборкаОЛЕ.СуммаДокумента;
			СтрДок.Договор				= Договор;
			СтрДок.НазначениеПлатежа	= ВыборкаОЛЕ.НазначениеПлатежа;
			СтрДок.Акт 					= ДокументУТ; 
			
		КонецЦикла;
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОплату(Команда)
	//
	БазаОЛЕ =  УП_Клиент.КлиентПодключитьсяКБазеОЛЕ_ПоИмени( "УправлениеТорговлей" );
	Если БазаОЛЕ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//
	ЗаполнитьОплату_НаКлиенте(  БазаОЛЕ );
	БазаОЛЕ = "";
	
	ПоказатьПредупреждение(,"Таблица документов оплаты заполнена!", 10);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОплату_НаСервере()
	Для Каждого СтрДок Из Объект.ТабОплаты Цикл
		//
		Если НЕ СтрДок.Переносить Тогда Продолжить; КонецЕсли;
		СтрДок.Переносить = Ложь;
		
		
		ДокСс = Документы.Оплата.НайтиПоНомеру( СтрДок.Номер, СтрДок.Дата );
		Если ДокСс.Пустая() Тогда
			ДокОб 				= Документы.Оплата.СоздатьДокумент();
		Иначе
			//			
			Если ДокСс.Проведен Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Документ " + ДокСс + " проведен, исправление запрещено!";
				Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			ДокОб 	= ДокСс.ПолучитьОбъект();
		КонецЕсли;				
		// 			
		ДокОб.ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
		ЗаполнитьЗначенияСвойств( ДокОб, СтрДок );
		
		
		Попытка
			ДокОб.Записать( РежимЗаписиДокумента.Запись);
		Исключение
			Сообщить("Не удалось записать документ " + ДокСс + ", " + ОписаниеОшибки());
		КонецПопытки;
					
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОплату(Команда)
	ЗагрузитьОплату_НаСервере();
	ПоказатьПредупреждение(,"Оплата договоров загружена!", 10);
КонецПроцедуры


//*****************************************************************************
// акты оказания услуг
&НаКлиенте
Процедура УстановитьФлАктов(Команда)
	ИзменитьФлажки( Объект.ТабАкты,  Истина );
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлАктов(Команда)
	ИзменитьФлажки( Объект.ТабАкты,  Ложь );
КонецПроцедуры

&НаСервереБезКонтекста
Функция МенеджерПоДоговору(Договор)
	//Если ЗначениеЗаполнено( Договор.Проект ) Тогда
		Возврат Договор.Проект.МенеджерПроекта;
	//КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция АктПоGUID( GUID )
	АктСс  = Документы.ДокументУТ.НайтиПоРеквизиту("GUID", GUID);
	Возврат АктСс;
КонецФункции

//&НаКлиенте
//Процедура ЗаполнитьАкты_НаКлиенте(  БазаОЛЕ )
//	Объект.ТабАкты.Очистить();
//	
//	ВыборкаОЛЕ 	= БазаОЛЕ.Документы.АктВыполненныхРабот.Выбрать( НачалоДня(ПериодОтбора.ДатаНачала), КонецДня( ПериодОтбора.ДатаОкончания )); 
//	Пока ВыборкаОЛЕ.Следующий()  Цикл
//		Если НЕ ВыборкаОЛЕ.Проведен Тогда Продолжить; КонецЕсли;
//		
//		// 		
//		ИННКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.ИНН);
//		КППКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.КПП);
//		Контрагент 		= КлиентНайтиКонтрагентаПоИННКПП( ИННКонтрагента,  КППКонтрагента);
//		Если Контрагент = Неопределено Тогда
//			Сообщить("Нет контрагента с ИНН [" + ИННКонтрагента + "], КПП [" + КППКонтрагента +"]");
//			Продолжить;
//		КонецЕсли;
//		Организация	= НайтиОрганизациюПоПрефиксу( СокрЛП(ВыборкаОЛЕ.Организация.Префикс) + "-" );
//		
//		// если нет договора, то не переносим платеж
//		Договор 		= НайтиДоговорПоНомеру( ВыборкаОЛЕ.ЗаказКлиента.Номер, ВыборкаОЛЕ.ЗаказКлиента.Дата);
//		Если Договор = Неопределено Тогда 
//			Сообщить("Не найден договор №" + ВыборкаОЛЕ.ЗаказКлиента.Номер + " от " + ВыборкаОЛЕ.ЗаказКлиента.Дата);
//			Продолжить;
//		КонецЕсли;
//		// guid акта
//		GUID  = БазаОЛЕ.String(ВыборкаОЛЕ.Ссылка.УникальныйИдентификатор());
//		// платеж !!!
//		СтрДок 						= Объект.ТабАкты.Добавить();
//		СтрДок.Переносить			= НЕ ЗначениеЗаполнено( АктПоGUID( GUID ));
//		СтрДок.GUID					= GUID;
//		СтрДок.Номер				= ВыборкаОЛЕ.Номер;
//		СтрДок.Дата			 		= ВыборкаОЛЕ.Дата; 
//		//
//		СтрДок.Контрагент			= Контрагент;
//		СтрДок.Организация			= Организация;
//		СтрДок.СуммаДокумента 		= ВыборкаОЛЕ.СуммаДокумента;
//		СтрДок.Договор				= Договор;
//		СтрДок.Менеджер  			= МенеджерПоДоговору(Договор);
//			
//	КонецЦикла;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументыУТ_НаКлиенте( КодВидаДокумента, БазаОЛЕ )
	ВидДокумента = ЗагрузитьВидДокумента( КодВидаДокумента );
	Если ВидДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаОЛЕ 	= БазаОЛЕ.Документы[КодВидаДокумента].Выбрать( НачалоДня(ПериодОтбора.ДатаНачала), КонецДня( ПериодОтбора.ДатаОкончания )); 
	Пока ВыборкаОЛЕ.Следующий()  Цикл
		Если НЕ ВыборкаОЛЕ.Проведен Тогда Продолжить; КонецЕсли;
		
		// 		
		ИННКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.ИНН);
		КППКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.КПП);
		Контрагент 		= КлиентНайтиКонтрагентаПоИННКПП( ИННКонтрагента,  КППКонтрагента);
		Если Контрагент = Неопределено Тогда
			Сообщить("Нет контрагента с ИНН [" + ИННКонтрагента + "], КПП [" + КППКонтрагента +"]");
			Продолжить;
		КонецЕсли;
		Организация	= НайтиОрганизациюПоПрефиксу( СокрЛП(ВыборкаОЛЕ.Организация.Префикс) + "-" );
		
		// если нет договора, то не переносим платеж
		Если БазаОЛЕ.ЗначениеЗаполнено( ВыборкаОЛЕ.ЗаказКлиента ) Тогда
			Договор 		= НайтиДоговорПоНомеру( ВыборкаОЛЕ.ЗаказКлиента.Номер, ВыборкаОЛЕ.ЗаказКлиента.Дата);
			Если Договор = Неопределено Тогда 
				Сообщить("Не найден договор №" + ВыборкаОЛЕ.ЗаказКлиента.Номер + " от " + ВыборкаОЛЕ.ЗаказКлиента.Дата);
				Продолжить;
			КонецЕсли;
		Иначе
			Сообщить("Не указан договор (заказ клиента) для " + ВидДокумента  + " № " + ВыборкаОЛЕ.Номер + " от " + ВыборкаОЛЕ.Дата);
			Продолжить;
			
		КонецЕсли;
		// guid акта
		GUID  = БазаОЛЕ.String(ВыборкаОЛЕ.Ссылка.УникальныйИдентификатор());
		// платеж !!!
		СтрДок 						= Объект.ТабАкты.Добавить();
		СтрДок.Переносить			= НЕ ЗначениеЗаполнено( АктПоGUID( GUID ));
		СтрДок.GUID					= GUID;
		СтрДок.Номер				= ВыборкаОЛЕ.Номер;
		СтрДок.Дата			 		= ВыборкаОЛЕ.Дата; 
		//
		СтрДок.Контрагент			= Контрагент;
		СтрДок.Организация			= Организация;
		СтрДок.СуммаДокумента 		= ВыборкаОЛЕ.СуммаДокумента;
		СтрДок.Договор				= Договор;
		// 20130807
		//СтрДок.Менеджер  			= МенеджерПоДоговору(Договор);
		СтрДок.ВидДокумента         = ВидДокумента;
			
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьАкты(Команда)

	БазаОЛЕ =  УП_Клиент.КлиентПодключитьсяКБазеОЛЕ_ПоИмени( "УправлениеТорговлей" );
	Если БазаОЛЕ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//
	Объект.ТабАкты.Очистить();
	
	ЗаполнитьДокументыУТ_НаКлиенте( "АктВыполненныхРабот", 		БазаОЛЕ );
	ЗаполнитьДокументыУТ_НаКлиенте( "РеализацияТоваровУслуг", 	БазаОЛЕ );
	БазаОЛЕ = "";
	Объект.ТабАкты.Сортировать("Дата,Номер");
	
	ПоказатьПредупреждение(,"Таблица документов заполнена!", 10);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьАкты_НаСервере()
	Для Каждого СтрДок Из Объект.ТабАкты Цикл
		//
		Если НЕ СтрДок.Переносить Тогда Продолжить; КонецЕсли;
		СтрДок.Переносить = Ложь;
		
		ДокСс = АктПоGUID( СтрДок.GUID );
		Если ДокСс.Пустая() Тогда
			ДокОб = Документы.ДокументУТ.СоздатьДокумент();
		Иначе
			//			
			Если ДокСс.Проведен Тогда
				Сообщить("Документ " + ДокСс + " проведен, исправление запрещено!");
				Продолжить;
			КонецЕсли;
			ДокОб 	= ДокСс.ПолучитьОбъект();
		КонецЕсли;				
		// 			
		ДокОб.ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
		ЗаполнитьЗначенияСвойств( ДокОб, СтрДок );
		
		
		Попытка
			ДокОб.Записать( РежимЗаписиДокумента.Запись);
		Исключение
			Сообщить("Не удалось записать документ " + ДокСс + ", " + ОписаниеОшибки());
		КонецПопытки;
					
	КонецЦикла;		
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьАкты(Команда)
	ЗагрузитьАкты_НаСервере();
	ПоказатьПредупреждение(,"Документы загружены!", 10);
	
КонецПроцедуры
